[
    {
        "id": 1,
        "name": "Hope Horizon API",
        "image": "/images/projects/image1.png",
        "description": "The Hope Horizon API project provides the backend for the Hope Horizon community support platform. It is built with Django and the REST framework, aiming to connect people in need with charitable organizations and individuals.",
        "description_vn": "Dự án Hope Horizon API cung cấp backend cho nền tảng hỗ trợ cộng đồng Hope Horizon. Dự án được xây dựng với Django và REST framework, phục vụ mục tiêu kết nối những người cần giúp đỡ với các tổ chức và cá nhân thiện nguyện.",
        "link": "https://example.com/project1",
        "languages": [
            {
                "name": "Django"
            },
            {
                "name": "PostgreSQL"
            }
        ],
        "project_details": [
            {
                "id": 1,
                "name_type": "API Development",
                "date": "Oct 23, 2024",
                "description_long": "<p><strong>The Hope Horizon API project</strong> serves as the backbone of the Hope Horizon community support platform, providing all the essential backend functionalities that enable seamless interactions between users. Built using <strong>Django</strong> and the <strong>Django REST Framework</strong>, the system is designed to be <em>scalable, secure, and flexible</em>, ensuring that data flows smoothly between the platform’s frontend and its database.</p><p>At its core, the API empowers the platform to <strong>connect people in need with charitable organizations, volunteers, and individuals</strong> who are willing to offer assistance, whether in the form of donations, services, or emotional support. Beyond simply handling requests and responses, the Hope Horizon API also plays a key role in <strong>managing user authentication, organizing resources, and ensuring that every connection is meaningful and trustworthy</strong>.</p><p>By combining robust technology with a mission-driven purpose, the project not only supports technical functionality but also helps <strong>foster a connected community and spread hope</strong> to those seeking help.</p>",
                "description_long_vn": "<p><strong>Dự án Hope Horizon API</strong> đóng vai trò là nền tảng cốt lõi cho hệ thống hỗ trợ cộng đồng Hope Horizon, cung cấp toàn bộ các chức năng backend cần thiết để kết nối và tương tác giữa người dùng. Được xây dựng bằng <strong>Django</strong> và <strong>Django REST Framework</strong>, hệ thống được thiết kế theo hướng <em>mở rộng, an toàn và linh hoạt</em>, đảm bảo dữ liệu luôn được xử lý trơn tru giữa giao diện người dùng và cơ sở dữ liệu.</p><p>Trọng tâm của API này là giúp <strong>kết nối những người đang gặp khó khăn với các tổ chức từ thiện, tình nguyện viên và những cá nhân sẵn lòng giúp đỡ</strong>, dù đó là sự hỗ trợ về tài chính, dịch vụ hay tinh thần. Ngoài việc xử lý các yêu cầu và phản hồi, Hope Horizon API còn giữ vai trò quan trọng trong việc <strong>quản lý xác thực người dùng, tổ chức nguồn lực, và đảm bảo mọi kết nối đều đáng tin cậy và ý nghĩa</strong>.</p><p>Bằng cách kết hợp giữa nền tảng công nghệ vững chắc và mục tiêu nhân văn, dự án không chỉ mang đến một hệ thống kỹ thuật hiện đại, mà còn góp phần <strong>xây dựng cộng đồng gắn kết và lan tỏa hy vọng</strong> đến những ai đang cần sự giúp đỡ.</p>",
                "link_be": "https://github.com/KaiO277/Hope_Horizon_api",
                "link_fe": "https://example.com/frontend",
                "link_youtube": "/images/projects/image1.png",
                "features": [
                    {
                        "id": 1,
                        "name": "JWT Authentication"
                    },
                    {
                        "id": 2,
                        "name": "User Management"
                    },
                    {
                        "id": 3,
                        "name": "Data Analytics"
                    }
                ],
                "date_vn": "23/10/2024"
            }
        ]
    },
    {
        "id": 2,
        "name": "TechieShop",
        "image": "/images/projects/image2.png",
        "description": "TechieShop is a trusted retailer specializing in genuine electronic products such as smartphones, laptops, accessories, and smart devices.",
        "description_vn": "TechieShop là địa chỉ uy tín chuyên cung cấp các sản phẩm điện tử chính hãng như điện thoại, laptop, phụ kiện và thiết bị thông minh.",
        "link": "https://example.com/project2",
        "languages": [
            {
                "name": "Python"
            },
            {
                "name": "PostgreSQL"
            },
            {
                "name": "ReactJS"
            },
            {
                "name": "Django"
            }
        ],
        "project_details": [
            {
                "id": 2,
                "name_type": "E-commerce Platform",
                "date": "May 19, 2025",
                "description_long": "Developed an e-commerce platform with user authentication and product management.",
                "link_be": "https://github.com/KaiO277/BE_Node_TechieShop",
                "link_fe": "https://github.com/KaiO277/TechieShop_UI",
                "link_youtube": "https://youtube.com/example2",
                "features": [
                    {
                        "id": 1,
                        "name": "JWT Authentication"
                    },
                    {
                        "id": 2,
                        "name": "User Management"
                    },
                    {
                        "id": 3,
                        "name": "Data Analytics"
                    }
                ],
                "date_vn": "19/05/2025"
            }
        ]
    },
    {
        "id": 3,
        "name": "Odoo ERP - Sale Checkin Map",
        "image": "/images/projects/image3.png",
        "description": "Odoo ERP – Sale Checkin Map is an Odoo-based project featuring a map check-in function to support sales management.",
        "description_vn": "Odoo ERP – Sale Checkin Map là dự án trên nền tảng Odoo với tính năng check-in bằng bản đồ.",
        "link": "https://example.com/project3",
        "languages": [
            {
                "name": "Odoo"
            },
            {
                "name": "PostgreSQL"
            }
        ],
        "project_details": [
            {
                "id": 3,
                "name_type": "Sales Management",
                "date": "Jul 26, 2025",
                "description_long": "Implemented a check-in feature for sales staff using Odoo.",
                "link_be": "https://github.com/KaiO277/TTTN_project",
                "link_fe": "",
                "link_youtube": "https://youtube.com/example3",
                "features": [
                    {
                        "id": 1,
                        "name": "JWT Authentication"
                    },
                    {
                        "id": 2,
                        "name": "User Management"
                    },
                    {
                        "id": 3,
                        "name": "Data Analytics"
                    }
                ],
                "date_vn": "26/07/2025"
            }
        ]
    }
]