[
    {
        "id": 1,
        "name": "Hope Horizon API",
        "image": "/images/projects/image1.png",
        "description": "The Hope Horizon API project provides the backend for the Hope Horizon community support platform. It is built with Django and the REST framework, aiming to connect people in need with charitable organizations and individuals.",
        "description_vn": "Dự án Hope Horizon API cung cấp backend cho nền tảng hỗ trợ cộng đồng Hope Horizon. Dự án được xây dựng với Django và REST framework, phục vụ mục tiêu kết nối những người cần giúp đỡ với các tổ chức và cá nhân thiện nguyện.",
        "link": "https://example.com/project1",
        "languages": [
            {
                "name": "Django"
            },
            {
                "name": "PostgreSQL"
            }
        ],
        "project_details": [
            {
                "id": 1,
                "name_type": "API Development",
                "date": "Oct 23, 2024",
                "description_long": "<p><strong>The Hope Horizon API project</strong> serves as the backbone of the Hope Horizon community support platform, providing all the essential backend functionalities that enable seamless interactions between users. Built using <strong>Django</strong> and the <strong>Django REST Framework</strong>, the system is designed to be <em>scalable, secure, and flexible</em>, ensuring that data flows smoothly between the platform’s frontend and its database.</p><p>At its core, the API empowers the platform to <strong>connect people in need with charitable organizations, volunteers, and individuals</strong> who are willing to offer assistance, whether in the form of donations, services, or emotional support. Beyond simply handling requests and responses, the Hope Horizon API also plays a key role in <strong>managing user authentication, organizing resources, and ensuring that every connection is meaningful and trustworthy</strong>.</p><p>By combining robust technology with a mission-driven purpose, the project not only supports technical functionality but also helps <strong>foster a connected community and spread hope</strong> to those seeking help.</p>",
                "description_long_vn": "<p><strong>Dự án Hope Horizon API</strong> đóng vai trò là nền tảng cốt lõi cho hệ thống hỗ trợ cộng đồng Hope Horizon, cung cấp toàn bộ các chức năng backend cần thiết để kết nối và tương tác giữa người dùng. Được xây dựng bằng <strong>Django</strong> và <strong>Django REST Framework</strong>, hệ thống được thiết kế theo hướng <em>mở rộng, an toàn và linh hoạt</em>, đảm bảo dữ liệu luôn được xử lý trơn tru giữa giao diện người dùng và cơ sở dữ liệu.</p><p>Trọng tâm của API này là giúp <strong>kết nối những người đang gặp khó khăn với các tổ chức từ thiện, tình nguyện viên và những cá nhân sẵn lòng giúp đỡ</strong>, dù đó là sự hỗ trợ về tài chính, dịch vụ hay tinh thần. Ngoài việc xử lý các yêu cầu và phản hồi, Hope Horizon API còn giữ vai trò quan trọng trong việc <strong>quản lý xác thực người dùng, tổ chức nguồn lực, và đảm bảo mọi kết nối đều đáng tin cậy và ý nghĩa</strong>.</p><p>Bằng cách kết hợp giữa nền tảng công nghệ vững chắc và mục tiêu nhân văn, dự án không chỉ mang đến một hệ thống kỹ thuật hiện đại, mà còn góp phần <strong>xây dựng cộng đồng gắn kết và lan tỏa hy vọng</strong> đến những ai đang cần sự giúp đỡ.</p>",
                "link_be": "https://github.com/KaiO277/Hope_Horizon_api",
                "link_fe": "https://example.com/frontend",
                "link_youtube": "/images/projects/image1.png",
                "features": [
                    {
                        "id": 1,
                        "name": "JWT Authentication"
                    },
                    {
                        "id": 2,
                        "name": "User Management"
                    },
                    {
                        "id": 3,
                        "name": "Data Analytics"
                    }
                ],
                "date_vn": "23/10/2024"
            }
        ]
    },
    {
        "id": 2,
        "name": "TechieShop",
        "image": "/images/projects/image2.png",
        "description": "TechieShop is a trusted retailer specializing in genuine electronic products such as smartphones, laptops, accessories, and smart devices.",
        "description_vn": "TechieShop là địa chỉ uy tín chuyên cung cấp các sản phẩm điện tử chính hãng như điện thoại, laptop, phụ kiện và thiết bị thông minh.",
        "link": "https://example.com/project2",
        "languages": [
            {
                "name": "Python"
            },
            {
                "name": "PostgreSQL"
            },
            {
                "name": "ReactJS"
            },
            {
                "name": "Django"
            }
        ],
        "project_details": [
            {
                "id": 2,
                "name_type": "E-commerce Platform",
                "date": "May 19, 2025",
                "description_long": "<p><strong>TechieShop</strong> is a trusted and reliable retailer that focuses on providing customers with genuine, high-quality electronic products. Its product range covers a wide variety of technology essentials, including <strong>smartphones, laptops, computer accessories, and modern smart devices</strong> that enhance everyday life. By carefully selecting only authentic products from reputable manufacturers, TechieShop ensures that every purchase meets the highest standards of quality and performance.</p><p>In addition to its diverse product catalog, TechieShop is also committed to delivering excellent customer service. From helping customers choose the right device to providing after-sales support, the company strives to build long-term relationships based on trust and satisfaction. With its dedication to authenticity, innovation, and customer care, TechieShop has become a go-to destination for tech enthusiasts and everyday users alike.</p>",
                "description_long_vn": "<p><strong>TechieShop</strong> là một thương hiệu bán lẻ đáng tin cậy, chuyên cung cấp cho khách hàng những sản phẩm điện tử chính hãng và chất lượng cao. Danh mục sản phẩm của TechieShop rất đa dạng, bao gồm <strong>điện thoại thông minh, máy tính xách tay, phụ kiện công nghệ và các thiết bị thông minh hiện đại</strong> giúp nâng cao trải nghiệm cuộc sống hàng ngày. Bằng việc lựa chọn kỹ lưỡng các sản phẩm chính hãng từ những nhà sản xuất uy tín, TechieShop đảm bảo rằng mọi giao dịch đều đạt tiêu chuẩn cao nhất về chất lượng và hiệu suất.</p><p>Bên cạnh danh mục sản phẩm phong phú, TechieShop còn cam kết mang đến dịch vụ khách hàng tận tâm. Từ việc hỗ trợ lựa chọn sản phẩm phù hợp cho đến dịch vụ hậu mãi, công ty luôn nỗ lực xây dựng mối quan hệ lâu dài dựa trên sự tin tưởng và hài lòng. Với sự chú trọng vào tính chính hãng, đổi mới và chăm sóc khách hàng, TechieShop đã trở thành điểm đến đáng tin cậy cho cả những người yêu công nghệ lẫn người dùng phổ thông.</p>",
                "link_be": "https://github.com/KaiO277/BE_Node_TechieShop",
                "link_fe": "https://github.com/KaiO277/TechieShop_UI",
                "link_youtube": "https://youtube.com/example2",
                "features": [
                    {
                        "id": 1,
                        "name": "JWT Authentication"
                    },
                    {
                        "id": 2,
                        "name": "User Management"
                    },
                    {
                        "id": 3,
                        "name": "Data Analytics"
                    }
                ],
                "date_vn": "19/05/2025"
            }
        ]
    },
    {
        "id": 3,
        "name": "Odoo ERP - Sale Checkin Map",
        "image": "/images/projects/image3.png",
        "description": "Odoo ERP – Sale Checkin Map is an Odoo-based project featuring a map check-in function to support sales management.",
        "description_vn": "Odoo ERP – Sale Checkin Map là dự án trên nền tảng Odoo với tính năng check-in bằng bản đồ.",
        "link": "https://example.com/project3",
        "languages": [
            {
                "name": "Odoo"
            },
            {
                "name": "PostgreSQL"
            }
        ],
        "project_details": [
            {
                "id": 3,
                "name_type": "Sales Management",
                "date": "Jul 26, 2025",
                "description_long": "<p><strong>Odoo ERP – Sale Checkin Map</strong> is an Odoo-based solution that adds a map check-in capability to streamline field sales management. Built on Odoo’s modular framework, it enables sales reps to record on-site visits with precise geolocation, timestamp, and notes directly from desktop or mobile, creating a reliable audit trail of customer interactions.</p><p>The module supports manager visibility with real-time check-in views on a map, visit history per customer, and basic analytics for coverage, frequency, and route effectiveness. It integrates with Odoo Sales/CRM objects (customers, opportunities, orders) to attach check-ins to business records, and includes configurable access rights to protect data. The result is a practical tool for planning, executing, and validating field activities while improving accountability and decision-making.</p>",
                "description_long_vn": "<p><strong>Odoo ERP – Sale Checkin Map</strong> là một giải pháp dựa trên nền tảng Odoo, bổ sung tính năng check-in trên bản đồ nhằm tối ưu hóa quản lý bán hàng tại hiện trường. Được xây dựng trên kiến trúc mô-đun của Odoo, công cụ này cho phép nhân viên kinh doanh ghi nhận các lần ghé thăm khách hàng với thông tin vị trí địa lý chính xác, thời gian và ghi chú ngay từ máy tính hoặc thiết bị di động, tạo nên một hồ sơ minh bạch và đáng tin cậy về quá trình tương tác với khách hàng.</p><p>Mô-đun hỗ trợ nhà quản lý theo dõi thông tin thông qua bản đồ check-in theo thời gian thực, lịch sử ghé thăm của từng khách hàng và các phân tích cơ bản về mức độ bao phủ, tần suất cũng như hiệu quả tuyến đường. Nó được tích hợp với các phân hệ Bán hàng/CRM của Odoo (khách hàng, cơ hội, đơn hàng) để liên kết check-in trực tiếp với hồ sơ kinh doanh, đồng thời có thiết lập quyền truy cập linh hoạt nhằm đảm bảo tính bảo mật dữ liệu. Kết quả mang lại là một công cụ thiết thực giúp lập kế hoạch, triển khai và xác thực hoạt động bán hàng tại hiện trường, đồng thời nâng cao tính minh bạch và hỗ trợ ra quyết định hiệu quả.</p>",
                "link_be": "https://github.com/KaiO277/TTTN_project",
                "link_fe": "",
                "link_youtube": "https://youtube.com/example3",
                "features": [
                    {
                        "id": 1,
                        "name": "JWT Authentication"
                    },
                    {
                        "id": 2,
                        "name": "User Management"
                    },
                    {
                        "id": 3,
                        "name": "Data Analytics"
                    }
                ],
                "date_vn": "26/07/2025"
            }
        ]
    }
]